Revit 2024 API
IExternalServer.GetDescription Method
 Implement this method to return a description of the server.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
string GetDescription()
Visual Basic
Function GetDescription As String
Visual C++
String^ GetDescription()
Return Value
 Description of the server.
Remarks
The purpose of this string is to describe the external server in more details than just a short name alone could do. The intended use is to show the string to the end user in UI when UI is appropriate for the corresponding external service.
Beside the requirement for it to be a non-empty string, there are no other general restrictions imposed by the External Services Framework. However, the external service may have some specific rules in place for its servers.
See Also
IExternalServer Interface
Autodesk.Revit.DB.ExternalService Namespace